README.org
# -*- mode: org; mode: flyspell -*-
#+TITLE: Emacs -- Beating the Learning Curve
#+SUBTITLE: From Zero to Lightspeed.
#+AUTHOR: Timo Bingmann
#+LATEX_CLASS: article
#+LaTeX_HEADER: \usepackage{fullpage}
#+LaTeX_HEADER: \parindent=0pt
#+LaTeX_HEADER: \parskip=\smallskipamount
#+LaTeX_HEADER: \usepackage[T1]{fontenc}
#+LaTeX_HEADER: \usepackage{lmodern}
#+LaTeX_HEADER: \usepackage{enumitem}
#+LaTeX_HEADER: \setlist{nolistsep}
#+LaTeX_HEADER: \usepackage{tocloft}
#+LaTeX_HEADER: \setlength{\cftbeforesecskip}{0pt}

* Overview

This is a quick and dirty emacs tutorial. It does not feature the most flashy
features or goodies. Instead, it focuses on solid day-to-day efficiency
features. It is probably best to print out this tutorial, grab a version of
emacs, and start reading and trying out each command in this manual from top to
bottom.

Do not start using emacs with the default config. Clone this repository as
=.emacs.d= by running

=git clone https://github.com/bingmann/dot-emacs.git .emacs.d=

in your home directory. Then start emacs, which will download lots of additional
packages. If that fails, check that you have at least emacs 24.5 by running =emacs
--version=, and download a packaged tarball snapshot of the repository from

https://github.com/bingmann/dot-emacs/releases/download/20150818/dot-emacs-snapshot-20150818.tar.bz2

Emacs commands are *sequences of key strokes* also called *key chords*. You must
get every stroke right, otherwise a different command is called. Key modifiers
are are written as

| =S-= | for Shift and/or implicitly notated by a capital or symbol, |
| =C-= | for Control, and                                            |
| =M-= | for Alt, called Meta in the emacs world.                    |

I disable the menubar in emacs since it takes up screen space and distracts from
the text. But for learning emacs it is a *good idea to enable it*: edit
=.emacs.d/init.el=, find =(menu-bar-mode -1)=, and replace it with
=(menu-bar-mode 1)= to enable the menubar after the next restart.

emacs has an *invisible interface*; even with the menu bar, you get no buttons
to click on, and only the most necessary output about what it
happening. Interaction and status information is shown in the *mode line* and
the *mini-buffer* at the bottom.

* Most Important Key Chords

** When Things Go Wrong
These are maybe the *most important* key strokes: canceling when things go
wrong. If some command does not work as expected: press these and try again;
emacs may have been in some state you did not know about.

| Cancel Command    | =C-g=                             |
| Cancel Minibuffer | =C-]= (try if =C-g= did not work) |
| Undo typing       | =C-/= or =C-S-_= (underscore)     |

Some buffers can be closed with =q=, usually those which are interactive buffers
and not plain text editing ones.

** Meta-X
Nearly any Emacs command can be called using =M-x += long function
description. All key chords are bindings to these long functions, and yes, you
can change the key bindings some day.

See this xkcd comic for on what =M-x= is for: https://xkcd.com/378/. Then try
=M-x butterfly=.

** Move Around in Text
| Move                     | =arrow= keys, =PageUp/Down=, etc |
| Typing                   | =[keys]=, =Delete=, =Backspace=  |
| Move Faster (jump words) | =C-arrows=                       |
| Beginning and End        | =C-Home= / =C-End=               |
| Move Along Brace Tree    | =C-M-S-arrows=                   |
| Center Line in Window    | =C-l=                            |
| Move to Last Edit        | =C-M-l= (repeatable)             |
| Goto Line                | =M-g=                            |

** Mark, Copy, and Paste Text
Copy and Paste is *totally different* from the usual =C-c=, =C-v= sequences. Get
used to it. =C-c= and =C-x= are much more powerful in emacs than mere
copying/cutting.

| Start Marking Region       | =C-space=                  |
| Copy                       | =M-w=                      |
| Cut (called Kill)          | =C-w=                      |
| Paste (called Yank)        | =C-y=                      |
| Yank previous Kill         | =M-y= again                |
| Kill Line                  | =C-k= (repeatable)         |
| Kill Word Forward/Backward | =C-Delete= / =C-Backspace= |
| Cut Word Forward/Backward  | =M-Delete= / =M-Backspace= |

** Open File into Buffers
| Open File           | =C-x C-f=           |
| Save Buffer         | =C-x C-s=           |
| Save All Buffers    | =C-x s=             |
| Save As ...         | =C-x C-w=           |
| Close (Kill) Buffer | =C-x k=             |
| Revert Buffer       | =M-x revert-buffer= |

You don't need to enter the full path. Just open a directory and use the
directory listing to navigate.

In my config there is a special mode activated which makes opening existing
files faster (you see the available completions), but creating new ones from
scratch difficult. To create a new file press =C-z= while in =C-x C-f= mode. It
stops the automatic fuzzy searches for existing files.

** Switching Buffers (Open Files)
| Cycle Buffer | =M-S-left= / =M-S-right=      |
| Buffer List  | =M-S-up= (originally: =C-x b=) |

