README.org
** Organizing Buffers into Frames and Windows
There are frames and windows in emacs: frames are independent windows as seen by
their border. Frames can internally be split into windows (horizontally or
vertically). This often happens automatically, but you can do it manually to
edit files at multiple places.

| Full Frame            | =M-~= (remap this if you use a German keyboard) or =C-x 1= |
| Split Frame           | =M-2= or =C-x 5=                                           |
| Kill Frame            | =M-3=                                                      |
| Split Window          | =C-x 2= horizontally, =C-x 3= vertically                   |
| Movement among frames | =M-left= / =M-right=                                       |
| Switch to other frame | =C-x o=                                                    |

** Search and Replace
| Incremental Search   | =C-s <text>=                                      |
| Search Backwards     | =C-r <text>=                                      |
| Search/Replace       | =M-S-%= (follow prompt, keys: =y=, =n=, =^=, =!=) |
| Regex Search/Replace | =C-M-S-%=                                         |

** Change Font Size
| Larger Font    | =C-mouse wheel up= or =C-x += (repeat =+=)   |
| Smaller Font   | =C-mouse wheel down= or =C-x -= (repeat =-=) |
| Zero Font Size | =C-x 0=                                      |

* Advanced Text Editing

Undo, redo, search and replace can be constrained using the mark region. Undo
only within a marked region is very powerful for coding!

Further simple commands are:

| Comment or Uncomment Region | (mark region) =C-space=   |
| Wrap (Fill) Paragraph       | =M-q=                     |
| Fix indentation of region   | =M-C-q= (depends on mode) |
| Upper/Lowercase Words       | =M-u= / =M-l=             |

** Rectangle Copy/Paste
| Mark Rectangle Region               | =C-space= (ignore blue marking area) |
| Insert Text in each line            | =C-x r t=                            |
| Open Area (insert with spaces)      | =C-x r o=                            |
| Cancel Area (overwrite with spaces) | =C-x r c=                            |
| Kill (Cut) Area                     | =C-x r k=                            |
| Yank (Paste) Area (inserts space)   | =C-x r y=                            |

** Keyboard Macros
| Record Macro       | =C-x (=                            |
| End Recording      | =C-x )=                            |
| Execute Macro      | =C-x e= (then repeat =e= for more) |
| Repeated Execution | =ESC <num> C-x e=                  |

** Run Shell Commands
| Run Single Command          | =M-S-!=      |
| Pipe Marked Area to Command | =M-S-(pipe)= |

** Multiple Cursors
| Make more Cursors               | =C-S-click= |
| Exit Multi-Cursors              | =C-g=       |
| Mark all like this with cursors | =C-c !=     |

Multi cursors is a hack, but works reasonably well for simple things.

* Directory Listings (dired)

The directory listing, called dired, can be used to navigate the file system,
perform copy/move operations, and more.

| Show Dir/File                      | =Enter=       |
| Go Up To Parent Directory          | =Backspace=   |
| Refresh                            | =g=           |
| Mark File                          | =m=           |
| Unmark File                        | =u=           |
| Unmark all                         | =S-U=         |
| Delete File or Marked Files        | =D=           |
| Copy File or Marked Files          | =C=           |
| Rename File or Marked Files        | =C=           |
| Chmod a File                       | =M=           |
| Copy Marked Filelist to Clipboard  | =M-w= (Copy)  |
| Cut Marked Filelist to Clipboard   | =C-w= (Cut)   |
| Paste Filelist from Clipboard      | =C-y= (Paste) |
| Make Directory                     | =+=           |
| Search and Replace in Marked Files | =Q=           |
| Mark File for Deletion             | =d=           |
| Execute Deletion for Marks         | =x=           |

Note: with my config, PDFs open with evince.

** Give Me a Terminal, NOW!

If dired is not good enough, and you need a terminal. The =F4= key opens an
(external) terminal in the current directory. It works /everywhere/, also if you
are editing a file.

| Open Terminal, HERE. | =F4= |

** Tramp Mode

Emacs can also edit files on a remote system, controlling it via ssh. For this
"open" a remote directory using =/[user@]ssh-host:path=. You can also just as
=/ssh-host:= if you ssh shortcuts are configured.

Most (really: almost all) operations are fully transparent, e.g., dired works on
the remote system just as well. Yes, copy and paste works across machines. Yes,
open a terminal if you need it. Yes, magit works (see below).

* Customization

Emacs has a myriad of customizable configuration variables, and every package
can add its own set. But customizing all this complexity is actually easy,
because the configuration browser is very good.

| Launch customization browser           | =M-x customize=      |
| Search variables, funtions, etc        | =M-x apropos=        |
| Change face (e.g., color) under cursor | =M-x customize-face= |

Note that you must load the package you want to customize before calling
customize, otherwise the options may not appear. (Kind of obvious, otherwise
options of all possible packages would need to be in the menu).

