README.md

## Organizing Buffers into Frames and Windows<a id="orgheadline8"></a>

There are frames and windows in emacs: frames are independent windows as seen by
their border. Frames can internally be split into windows (horizontally or
vertically). This often happens automatically, but you can do it manually to
edit files at multiple places.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Full Frame</td>
<td class="org-left">`M-~` (remap this if you use a German keyboard) or `C-x 1`</td>
</tr>


<tr>
<td class="org-left">Split Frame</td>
<td class="org-left">`M-2` or `C-x 5`</td>
</tr>


<tr>
<td class="org-left">Kill Frame</td>
<td class="org-left">`M-3`</td>
</tr>


<tr>
<td class="org-left">Split Window</td>
<td class="org-left">`C-x 2` horizontally, `C-x 3` vertically</td>
</tr>


<tr>
<td class="org-left">Movement among frames</td>
<td class="org-left">`M-left` / `M-right`</td>
</tr>


<tr>
<td class="org-left">Switch to other frame</td>
<td class="org-left">`C-x o`</td>
</tr>
</tbody>
</table>

## Search and Replace<a id="orgheadline9"></a>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Incremental Search</td>
<td class="org-left">`C-s <text>`</td>
</tr>


<tr>
<td class="org-left">Search Backwards</td>
<td class="org-left">`C-r <text>`</td>
</tr>


<tr>
<td class="org-left">Search/Replace</td>
<td class="org-left">`M-S-%` (follow prompt, keys: `y`, `n`, `^`, `!`)</td>
</tr>


<tr>
<td class="org-left">Regex Search/Replace</td>
<td class="org-left">`C-M-S-%`</td>
</tr>
</tbody>
</table>

## Change Font Size<a id="orgheadline10"></a>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Larger Font</td>
<td class="org-left">`C-mouse wheel up` or `C-x +` (repeat `+`)</td>
</tr>


<tr>
<td class="org-left">Smaller Font</td>
<td class="org-left">`C-mouse wheel down` or `C-x -` (repeat `-`)</td>
</tr>


<tr>
<td class="org-left">Zero Font Size</td>
<td class="org-left">`C-x 0`</td>
</tr>
</tbody>
</table>

# Advanced Text Editing<a id="orgheadline16"></a>

Undo, redo, search and replace can be constrained using the mark region. Undo
only within a marked region is very powerful for coding!

Further simple commands are:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Comment or Uncomment Region</td>
<td class="org-left">(mark region) `C-space`</td>
</tr>


<tr>
<td class="org-left">Wrap (Fill) Paragraph</td>
<td class="org-left">`M-q`</td>
</tr>


<tr>
<td class="org-left">Fix indentation of region</td>
<td class="org-left">`M-C-q` (depends on mode)</td>
</tr>


<tr>
<td class="org-left">Upper/Lowercase Words</td>
<td class="org-left">`M-u` / `M-l`</td>
</tr>
</tbody>
</table>

## Rectangle Copy/Paste<a id="orgheadline12"></a>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Mark Rectangle Region</td>
<td class="org-left">`C-space` (ignore blue marking area)</td>
</tr>


<tr>
<td class="org-left">Insert Text in each line</td>
<td class="org-left">`C-x r t`</td>
</tr>


<tr>
<td class="org-left">Open Area (insert with spaces)</td>
<td class="org-left">`C-x r o`</td>
</tr>


<tr>
<td class="org-left">Cancel Area (overwrite with spaces)</td>
<td class="org-left">`C-x r c`</td>
</tr>


<tr>
<td class="org-left">Kill (Cut) Area</td>
<td class="org-left">`C-x r k`</td>
</tr>


<tr>
<td class="org-left">Yank (Paste) Area (inserts space)</td>
<td class="org-left">`C-x r y`</td>
</tr>
</tbody>
</table>

## Keyboard Macros<a id="orgheadline13"></a>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Record Macro</td>
<td class="org-left">`C-x (`</td>
</tr>


<tr>
<td class="org-left">End Recording</td>
<td class="org-left">`C-x )`</td>
</tr>


<tr>
<td class="org-left">Execute Macro</td>
<td class="org-left">`C-x e` (then repeat `e` for more)</td>
</tr>


<tr>
<td class="org-left">Repeated Execution</td>
<td class="org-left">`ESC <num> C-x e`</td>
</tr>
</tbody>
</table>

## Run Shell Commands<a id="orgheadline14"></a>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Run Single Command</td>
<td class="org-left">`M-S-!`</td>
</tr>


<tr>
<td class="org-left">Pipe Marked Area to Command</td>
<td class="org-left">`M-S-(pipe)`</td>
</tr>
</tbody>
</table>

## Multiple Cursors<a id="orgheadline15"></a>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Make more Cursors</td>
<td class="org-left">`C-S-click`</td>
</tr>


<tr>
<td class="org-left">Exit Multi-Cursors</td>
<td class="org-left">`C-g`</td>
</tr>


<tr>
<td class="org-left">Mark all like this with cursors</td>
<td class="org-left">`C-c !`</td>
</tr>
</tbody>
</table>

Multi cursors is a hack, but works reasonably well for simple things.

# Directory Listings (dired)<a id="orgheadline19"></a>

The directory listing, called dired, can be used to navigate the file system,
perform copy/move operations, and more.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Show Dir/File</td>
<td class="org-left">`Enter`</td>
</tr>


<tr>
<td class="org-left">Go Up To Parent Directory</td>
<td class="org-left">`Backspace`</td>
</tr>


<tr>
<td class="org-left">Refresh</td>
<td class="org-left">`g`</td>
</tr>


<tr>
<td class="org-left">Mark File</td>
<td class="org-left">`m`</td>
</tr>


<tr>
<td class="org-left">Unmark File</td>
<td class="org-left">`u`</td>
</tr>


<tr>
<td class="org-left">Unmark all</td>
<td class="org-left">`S-U`</td>
</tr>


<tr>
<td class="org-left">Delete File or Marked Files</td>
<td class="org-left">`D`</td>
</tr>


<tr>
<td class="org-left">Copy File or Marked Files</td>
<td class="org-left">`C`</td>
</tr>


<tr>
<td class="org-left">Rename File or Marked Files</td>
<td class="org-left">`C`</td>
</tr>


<tr>
<td class="org-left">Chmod a File</td>
<td class="org-left">`M`</td>
</tr>


<tr>
<td class="org-left">Copy Marked Filelist to Clipboard</td>
<td class="org-left">`M-w` (Copy)</td>
</tr>


<tr>
<td class="org-left">Cut Marked Filelist to Clipboard</td>
<td class="org-left">`C-w` (Cut)</td>
</tr>


<tr>
<td class="org-left">Paste Filelist from Clipboard</td>
<td class="org-left">`C-y` (Paste)</td>
</tr>


<tr>
<td class="org-left">Make Directory</td>
<td class="org-left">`+`</td>
</tr>


<tr>
<td class="org-left">Search and Replace in Marked Files</td>
<td class="org-left">`Q`</td>
</tr>


<tr>
<td class="org-left">Mark File for Deletion</td>
<td class="org-left">`d`</td>
</tr>


<tr>
<td class="org-left">Execute Deletion for Marks</td>
<td class="org-left">`x`</td>
</tr>
</tbody>
</table>

Note: with my config, PDFs open with evince.

## Give Me a Terminal, NOW!<a id="orgheadline17"></a>

If dired is not good enough, and you need a terminal. The `F4` key opens an
(external) terminal in the current directory. It works *everywhere*, also if you
are editing a file.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Open Terminal, HERE.</td>
<td class="org-left">`F4`</td>
</tr>
</tbody>
</table>

## Tramp Mode<a id="orgheadline18"></a>

Emacs can also edit files on a remote system, controlling it via ssh. For this
"open" a remote directory using `/[user@]ssh-host:path`. You can also just as
`/ssh-host:` if you ssh shortcuts are configured.

Most (really: almost all) operations are fully transparent, e.g., dired works on
the remote system just as well. Yes, copy and paste works across machines. Yes,
open a terminal if you need it. Yes, magit works (see below).

# Customization<a id="orgheadline20"></a>

Emacs has a myriad of customizable configuration variables, and every package
can add its own set. But customizing all this complexity is actually easy,
because the configuration browser is very good.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Launch customization browser</td>
<td class="org-left">`M-x customize`</td>
</tr>


<tr>
<td class="org-left">Search variables, funtions, etc</td>
<td class="org-left">`M-x apropos`</td>
</tr>


<tr>
<td class="org-left">Change face (e.g., color) under cursor</td>
<td class="org-left">`M-x customize-face`</td>
</tr>
</tbody>
</table>

Note that you must load the package you want to customize before calling
customize, otherwise the options may not appear. (Kind of obvious, otherwise
options of all possible packages would need to be in the menu).
