README.org
* Source code editing

Buffers in emacs have so called "modes" active, which enable various features
for the particular buffer. E.g., modes add color highlighting, keybindings,
extra macros and functions, etc. Modes can be activated and deactivated, usually
done using =M-x blah-mode=. E.g. =M-x orgtbl-mode= activates/deactives the
org-table-mode in the buffer.

Emacs knows most programming languages, even hip new ones. If not
out-of-the-box, then there is an addon mode for it. They are usually
automatically activated by the file extension.

TAB and *automatic indentation* is highly sophisticated in emacs. Do not fight
it, emacs will win. Instead either customized it (to the peril that others will
use the defaults), or adapt to it.

* C/C++ Projects

** Identifier Expansion
emacs has the cedet package for parsing C/C++ files. It is not as good as one
wants and it is slow. There are some newer alternatives that use clang, but I
have not been happy with them. Everything breaks down once there are few
dependent or complicated templates around.

Hence, I only use a dumb, very fast expander: you write a prefix and it will
look backwards in the text for a word that starts with it. This often turns out
to be more powerful, since it also expands words from strings, and from
comments, from other open buffers, and then looks into the current directory for
matching file names.

| hippie-expand | =M-/= |

** Snippets
I use yasnippets to expand some very frequently used code blocks. There are not
that many, otherwise you should use the language and write a function for
it. Expansion is trigged by snippet =keyword + TAB=.

| =main=            | =int main(int argc...) ...=                                 |
| =for=             | a for loop with index                                       |
| =fori=            | a for loop with iterators                                   |
| =inc=             | =#include <...>=                                            |
| =noncopyable=     | copy-construct + operator= set to "delete"                  |
| =noncopyablemove= | noncopyable + move constructor / operator= set to "default" |
| =op<<=            | =friend std::ostream operator << (...)=                     |
| =copy=            | =Copyright (C) <year> Timo Bingmann <tb...=                 |
| =cout=            | =std::cout << ... << std::endl;=                            |
| =hr=              | =/***************/= (80 cols) horizontal rule               |
| =lock=            | =std::unique_lock<std::mutex> lock(mutex_);=                |
| =debug=           | =static const bool debug = true;=                           |
| =doc=             | =/*! doxygen block=                                         |
| =try=             | =try { ... } catch (...) { ... }=                           |

** Semantics Jumps
Cedet parses the C/C++ files in a project and creates an index of symbols. If I
want to jump to a symbol, I give cedet a try. It works sometimes, usually if the
programs is small. It does not work with templates. Then I use grep. Renaming
variable within the function scope also works sometimes (but not always).

| Cedet jump to symbol  | =C-c <=   |
| Cedet rename variable | =C-c C-r= |
| Switch hpp/cpp files  | =F3=      |

** Ede (Cedet) Projects
Emacs is not very intelligent in detecting the root of a C/C++ project. It must
be told where projects start. This also makes cedet work better.

ede projects work great with CMake. The additional include paths are also used
during keyword expansion.

For emacs to know about a project, you must put the following into your =.emacs.d=:

#+BEGIN_SRC emacs-lisp
(ede-cpp-root-project "thrill"
    :file "~/thrill/CMakeLists.txt"
    :include-path '("/extlib/gtest/")
    :compile-command "cd build && make -j4 && ctest -V && cd .. && doxygen"
    ))
#+END_SRC

The compile-command can be used to set a default (magic) compile command line to
run within the project directory. Yes, this gives you click-able error
messages. It also saves all buffers for you.

| Auto-Magic Compile or Recompile | =F5=          |
| Custom Compile Command          | =M-x compile= |

** Grep and Ag
For searching a source tree I currently use =ag=, which is a =grep= replacement
for source files (construct matching automaton, mmap files, etc goodies, read:
FAST).

| Search for Words (ag or grep) | =C-c C-s= |

** Bookmarks
| Set/unset bookmark on line   | =M-F2= |
| Jump to next bookmarked line | =F2=   |
| Jump to previous bookmark    | =S-F2= |

** ecb - Emacs Code Browser

Some people like it. It gives you a directory listing, and a class and method
listing for navigation.

| Start ECB | =M-x ecb-activate= |

** TODO Tag Browsing

This is something I do not know how to use. Apparently, emacs has good support
for =ctags= and =global= tag files, but I never got it to work right for me.

** gdb inside emacs.

Possible, but wicked complex. I have not mastered it.

