README.md

# Source code editing<a id="orgheadline21"></a>

Buffers in emacs have so called "modes" active, which enable various features
for the particular buffer. E.g., modes add color highlighting, keybindings,
extra macros and functions, etc. Modes can be activated and deactivated, usually
done using `M-x blah-mode`. E.g. `M-x orgtbl-mode` activates/deactives the
org-table-mode in the buffer.

Emacs knows most programming languages, even hip new ones. If not
out-of-the-box, then there is an addon mode for it. They are usually
automatically activated by the file extension.

TAB and **automatic indentation** is highly sophisticated in emacs. Do not fight
it, emacs will win. Instead either customized it (to the peril that others will
use the defaults), or adapt to it.

# C/C++ Projects<a id="orgheadline31"></a>

## Identifier Expansion<a id="orgheadline22"></a>

emacs has the cedet package for parsing C/C++ files. It is not as good as one
wants and it is slow. There are some newer alternatives that use clang, but I
have not been happy with them. Everything breaks down once there are few
dependent or complicated templates around.

Hence, I only use a dumb, very fast expander: you write a prefix and it will
look backwards in the text for a word that starts with it. This often turns out
to be more powerful, since it also expands words from strings, and from
comments, from other open buffers, and then looks into the current directory for
matching file names.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">hippie-expand</td>
<td class="org-left">`M-/`</td>
</tr>
</tbody>
</table>

## Snippets<a id="orgheadline23"></a>

I use yasnippets to expand some very frequently used code blocks. There are not
that many, otherwise you should use the language and write a function for
it. Expansion is trigged by snippet `keyword + TAB`.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">`main`</td>
<td class="org-left">`int main(int argc...) ...`</td>
</tr>


<tr>
<td class="org-left">`for`</td>
<td class="org-left">a for loop with index</td>
</tr>


<tr>
<td class="org-left">`fori`</td>
<td class="org-left">a for loop with iterators</td>
</tr>


<tr>
<td class="org-left">`inc`</td>
<td class="org-left">`#include <...>`</td>
</tr>


<tr>
<td class="org-left">`noncopyable`</td>
<td class="org-left">copy-construct + operator= set to "delete"</td>
</tr>


<tr>
<td class="org-left">`noncopyablemove`</td>
<td class="org-left">noncopyable + move constructor / operator= set to "default"</td>
</tr>


<tr>
<td class="org-left">`op<<`</td>
<td class="org-left">`friend std::ostream operator << (...)`</td>
</tr>


<tr>
<td class="org-left">`copy`</td>
<td class="org-left">`Copyright (C) <year> Timo Bingmann <tb...`</td>
</tr>


<tr>
<td class="org-left">`cout`</td>
<td class="org-left">`std::cout << ... << std::endl;`</td>
</tr>


<tr>
<td class="org-left">`hr`</td>
<td class="org-left">`/***************/` (80 cols) horizontal rule</td>
</tr>


<tr>
<td class="org-left">`lock`</td>
<td class="org-left">`std::unique_lock<std::mutex> lock(mutex_);`</td>
</tr>


<tr>
<td class="org-left">`debug`</td>
<td class="org-left">`static const bool debug = true;`</td>
</tr>


<tr>
<td class="org-left">`doc`</td>
<td class="org-left">`/*! doxygen block`</td>
</tr>


<tr>
<td class="org-left">`try`</td>
<td class="org-left">`try { ... } catch (...) { ... }`</td>
</tr>
</tbody>
</table>

## Semantics Jumps<a id="orgheadline24"></a>

Cedet parses the C/C++ files in a project and creates an index of symbols. If I
want to jump to a symbol, I give cedet a try. It works sometimes, usually if the
programs is small. It does not work with templates. Then I use grep. Renaming
variable within the function scope also works sometimes (but not always).

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Cedet jump to symbol</td>
<td class="org-left">`C-c <`</td>
</tr>


<tr>
<td class="org-left">Cedet rename variable</td>
<td class="org-left">`C-c C-r`</td>
</tr>


<tr>
<td class="org-left">Switch hpp/cpp files</td>
<td class="org-left">`F3`</td>
</tr>
</tbody>
</table>

## Ede (Cedet) Projects<a id="orgheadline25"></a>

Emacs is not very intelligent in detecting the root of a C/C++ project. It must
be told where projects start. This also makes cedet work better.

ede projects work great with CMake. The additional include paths are also used
during keyword expansion.

For emacs to know about a project, you must put the following into your `.emacs.d`:

    (ede-cpp-root-project "thrill"
        :file "~/thrill/CMakeLists.txt"
        :include-path '("/extlib/gtest/")
        :compile-command "cd build && make -j4 && ctest -V && cd .. && doxygen"
        ))

The compile-command can be used to set a default (magic) compile command line to
run within the project directory. Yes, this gives you click-able error
messages. It also saves all buffers for you.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Auto-Magic Compile or Recompile</td>
<td class="org-left">`F5`</td>
</tr>


<tr>
<td class="org-left">Custom Compile Command</td>
<td class="org-left">`M-x compile`</td>
</tr>
</tbody>
</table>

## Grep and Ag<a id="orgheadline26"></a>

For searching a source tree I currently use `ag`, which is a `grep` replacement
for source files (construct matching automaton, mmap files, etc goodies, read:
FAST).

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Search for Words (ag or grep)</td>
<td class="org-left">`C-c C-s`</td>
</tr>
</tbody>
</table>

## Bookmarks<a id="orgheadline27"></a>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Set/unset bookmark on line</td>
<td class="org-left">`M-F2`</td>
</tr>


<tr>
<td class="org-left">Jump to next bookmarked line</td>
<td class="org-left">`F2`</td>
</tr>


<tr>
<td class="org-left">Jump to previous bookmark</td>
<td class="org-left">`S-F2`</td>
</tr>
</tbody>
</table>

## ecb - Emacs Code Browser<a id="orgheadline28"></a>

Some people like it. It gives you a directory listing, and a class and method
listing for navigation.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Start ECB</td>
<td class="org-left">`M-x ecb-activate`</td>
</tr>
</tbody>
</table>

## TODO Tag Browsing<a id="orgheadline29"></a>

This is something I do not know how to use. Apparently, emacs has good support
for `ctags` and `global` tag files, but I never got it to work right for me.

## gdb inside emacs.<a id="orgheadline30"></a>

Possible, but wicked complex. I have not mastered it.
