README.org
* Magit - Git Magic!

*Magit is awesome.* It is version controlling at a new level. It is
also *dangerously magical.*

| Launch magit | =C-F12= |

You see a listing of the current status, like =git status=. Navigate it like a
directory listing. *Single keystrokes* do a lot of things in magit, beware!
Keystrokes most often operate on the thing the *usual cursor* is on, beware
where the cursor is!

| Help!                             | =?=                                    |
| Visit thing under cursor          | =Enter=                                |
| Expand under cursor               | =TAB=                                  |
| Refresh (use often)               | =g= (same as in dired)                 |
| Stage file or diff part           | =s=                                    |
| Unstage a staged file or diff     | =u=                                    |
| Kill changes in file or diff part | =k=                                    |
| Start Commit                      | =c c=                                  |
| Amend last commit                 | =c a=                                  |
| (in commit) Stop commit           | =C-c C-k= (almost usual "kill buffer") |
| (in commit) Save commit           | =C-c C-c=                              |
| Push commits                      | =P= (read message) =P=                 |
| Pull commits                      | =F F= or =F -r F= for =--rebase=       |
| Show branches                     | =y=                                    |
| Checkout branch                   | =b b=                                  |
| Merge branch                      | =m m=                                  |
| Show log                          | =l= (read 100 options) =l=             |
| Stash                             | =z= (options) =z=                      |
| add to .gitignore                 | =i=                                    |

Magit lets you do things like:
- kill only partial changes (use region marking too)
- commit only a part of the changes in the working directory
- stash everything not staged (check before committing parts)
- use emacs merge tools: do magit merge, press =e= on a conflict.
- apply patch chunks from other diffs =a=. also: revert /parts/ of commits.
- kill local or remote branches: =k= in branch list.
- spell checking in commit messages.

* Editing LaTeX

LaTeX editing with emacs works for me as follows. The AUCTeX package have alot
more commands than I use, but the following is all I need. It is activated
automatically when opening a =.tex= file.

You usually want automatic spell checking when editing a LaTeX document, but
emacs must be configured to activate =flyspell= and with the right
*dictionary*. For this one puts the following line as the *first line* in the
=.tex= file:

#+BEGIN_SRC latex
% -*- mode: latex; mode: flyspell; ispell-local-dictionary: "en_US"; coding: utf-8 -*-
#+END_SRC

This enables =latex-mode=, =flyspell-mode=, UTF-8 encoding, and sets the
dictionary to =en_US=. See =/usr/share/hunspell/= for dictionaries available on
your system. There is a snippet for this mode-line, so don't bother copying and
pasting.

When editing LaTeX these are the most important key chords:

| Compile with pdflatex         | =C-c C-c= |
| View PDF file (once compiled) | =C-c C-v= |

In my config the compile command runs a script =flymake-pdflatex=, which tries
to be smart about when to run =bibtex= for bibliography and =makeindex= for
symbol lists. It is not perfect, but adaptable.

*Emacs and evince can synchronize!* Pressing =C-c C-v= moves the PDF viewer to the
current line in emacs. =C-click= in evince moves emacs to the clicked line (but
only if compiled with =C-c C-c=). I practically *never* search for a section in
emacs: just read the PDF, and click for editing!

Further key chords:

| Show TOC for navigation          | =M-S-down= (opposite to buffer menu) |
| Insert =\ref= from list          | =M-C-r=                              |
| Insert =\cite= from bibliography | =M-C-c=                              |
| Close environment                | =C-]=                                |
| Align =&= columns in a tabular   | =M-x align-current=                  |

Snippets while editing LaTeX files:

| =begin=     | =\begin{...} ... \end{...}=                   |
| =hr=        | =% -----= (80 cols)                           |
| =itemize=   | =\begin{itemize} \item ... \end{itemize}=     |
| =enumerate= | =\begin{enumerate} \item ... \end{enumerate}= |
| =frame=     | =% --- \begin{frame}{...} ... \end{frame}=    |
| =modeline=  | =-*- ... -*-= with dictionary selection       |

* org-mode

Org mode is the ultimate text-based tool for organizing things. The great thing
about org-mode files is, you can send them to people with no comment or
additional program, and they can read it. Plain ASCII files will be readable as
long as there are computers.

Learning org-mode is another presentation: see http://orgmode.org/

I use an org-mode file as my "welcome page" to emacs. It contains *everything*:
TODOs, *short cuts to current and past projects*, links to remote configuration
files, general notes, command line snippets, multi-year statistical information
like electricity bills, etc.

This file is written in org-mode, which can export to HTML, Markdown, PDF, and
probably a thousand other formats.

org-mode has automatic text-based tables, which can calculate and sort by
columns.

* evil-mode

There is evil in the world. If you want to turn from evil to good, emacs may
help you change from your evil way *gradually*. For this there is =evil-mode=,
which people say does evil things in emacs *better than evil itself*.

http://www.emacswiki.org/emacs/Evil

#+BIND: org-latex-tables-centered nil
#+STARTUP: showall
