README.md

# Magit - Git Magic!<a id="orgheadline32"></a>

**Magit is awesome.** It is version controlling at a new level. It is
also **dangerously magical.**

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Launch magit</td>
<td class="org-left">`C-F12`</td>
</tr>
</tbody>
</table>

You see a listing of the current status, like `git status`. Navigate it like a
directory listing. **Single keystrokes** do a lot of things in magit, beware!
Keystrokes most often operate on the thing the **usual cursor** is on, beware
where the cursor is!

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Help!</td>
<td class="org-left">`?`</td>
</tr>


<tr>
<td class="org-left">Visit thing under cursor</td>
<td class="org-left">`Enter`</td>
</tr>


<tr>
<td class="org-left">Expand under cursor</td>
<td class="org-left">`TAB`</td>
</tr>


<tr>
<td class="org-left">Refresh (use often)</td>
<td class="org-left">`g` (same as in dired)</td>
</tr>


<tr>
<td class="org-left">Stage file or diff part</td>
<td class="org-left">`s`</td>
</tr>


<tr>
<td class="org-left">Unstage a staged file or diff</td>
<td class="org-left">`u`</td>
</tr>


<tr>
<td class="org-left">Kill changes in file or diff part</td>
<td class="org-left">`k`</td>
</tr>


<tr>
<td class="org-left">Start Commit</td>
<td class="org-left">`c c`</td>
</tr>


<tr>
<td class="org-left">Amend last commit</td>
<td class="org-left">`c a`</td>
</tr>


<tr>
<td class="org-left">(in commit) Stop commit</td>
<td class="org-left">`C-c C-k` (almost usual "kill buffer")</td>
</tr>


<tr>
<td class="org-left">(in commit) Save commit</td>
<td class="org-left">`C-c C-c`</td>
</tr>


<tr>
<td class="org-left">Push commits</td>
<td class="org-left">`P` (read message) `P`</td>
</tr>


<tr>
<td class="org-left">Pull commits</td>
<td class="org-left">`F F` or `F -r F` for `--rebase`</td>
</tr>


<tr>
<td class="org-left">Show branches</td>
<td class="org-left">`y`</td>
</tr>


<tr>
<td class="org-left">Checkout branch</td>
<td class="org-left">`b b`</td>
</tr>


<tr>
<td class="org-left">Merge branch</td>
<td class="org-left">`m m`</td>
</tr>


<tr>
<td class="org-left">Show log</td>
<td class="org-left">`l` (read 100 options) `l`</td>
</tr>


<tr>
<td class="org-left">Stash</td>
<td class="org-left">`z` (options) `z`</td>
</tr>


<tr>
<td class="org-left">add to .gitignore</td>
<td class="org-left">`i`</td>
</tr>
</tbody>
</table>

Magit lets you do things like:

-   kill only partial changes (use region marking too)
-   commit only a part of the changes in the working directory
-   stash everything not staged (check before committing parts)
-   use emacs merge tools: do magit merge, press `e` on a conflict.
-   apply patch chunks from other diffs `a`. also: revert *parts* of commits.
-   kill local or remote branches: `k` in branch list.
-   spell checking in commit messages.

# Editing LaTeX<a id="orgheadline33"></a>

LaTeX editing with emacs works for me as follows. The AUCTeX package have alot
more commands than I use, but the following is all I need. It is activated
automatically when opening a `.tex` file.

You usually want automatic spell checking when editing a LaTeX document, but
emacs must be configured to activate `flyspell` and with the right
**dictionary**. For this one puts the following line as the **first line** in the
`.tex` file:

    % -*- mode: latex; mode: flyspell; ispell-local-dictionary: "en_US"; coding: utf-8 -*-

This enables `latex-mode`, `flyspell-mode`, UTF-8 encoding, and sets the
dictionary to `en_US`. See `/usr/share/hunspell/` for dictionaries available on
your system. There is a snippet for this mode-line, so don't bother copying and
pasting.

When editing LaTeX these are the most important key chords:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Compile with pdflatex</td>
<td class="org-left">`C-c C-c`</td>
</tr>


<tr>
<td class="org-left">View PDF file (once compiled)</td>
<td class="org-left">`C-c C-v`</td>
</tr>
</tbody>
</table>

In my config the compile command runs a script `flymake-pdflatex`, which tries
to be smart about when to run `bibtex` for bibliography and `makeindex` for
symbol lists. It is not perfect, but adaptable.

**Emacs and evince can synchronize!** Pressing `C-c C-v` moves the PDF viewer to the
current line in emacs. `C-click` in evince moves emacs to the clicked line (but
only if compiled with `C-c C-c`). I practically **never** search for a section in
emacs: just read the PDF, and click for editing!

Further key chords:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Show TOC for navigation</td>
<td class="org-left">`M-S-down` (opposite to buffer menu)</td>
</tr>


<tr>
<td class="org-left">Insert `\ref` from list</td>
<td class="org-left">`M-C-r`</td>
</tr>


<tr>
<td class="org-left">Insert `\cite` from bibliography</td>
<td class="org-left">`M-C-c`</td>
</tr>


<tr>
<td class="org-left">Close environment</td>
<td class="org-left">`C-]`</td>
</tr>


<tr>
<td class="org-left">Align `&` columns in a tabular</td>
<td class="org-left">`M-x align-current`</td>
</tr>
</tbody>
</table>

Snippets while editing LaTeX files:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">`begin`</td>
<td class="org-left">`\begin{...} ... \end{...}`</td>
</tr>


<tr>
<td class="org-left">`hr`</td>
<td class="org-left">`% -----` (80 cols)</td>
</tr>


<tr>
<td class="org-left">`itemize`</td>
<td class="org-left">`\begin{itemize} \item ... \end{itemize}`</td>
</tr>


<tr>
<td class="org-left">`enumerate`</td>
<td class="org-left">`\begin{enumerate} \item ... \end{enumerate}`</td>
</tr>


<tr>
<td class="org-left">`frame`</td>
<td class="org-left">`% --- \begin{frame}{...} ... \end{frame}`</td>
</tr>


<tr>
<td class="org-left">`modeline`</td>
<td class="org-left">`-*- ... -*-` with dictionary selection</td>
</tr>
</tbody>
</table>

# org-mode<a id="orgheadline34"></a>

Org mode is the ultimate text-based tool for organizing things. The great thing
about org-mode files is, you can send them to people with no comment or
additional program, and they can read it. Plain ASCII files will be readable as
long as there are computers.

Learning org-mode is another presentation: see <http://orgmode.org/>

I use an org-mode file as my "welcome page" to emacs. It contains **everything**:
TODOs, **short cuts to current and past projects**, links to remote configuration
files, general notes, command line snippets, multi-year statistical information
like electricity bills, etc.

This file is written in org-mode, which can export to HTML, Markdown, PDF, and
probably a thousand other formats.

org-mode has automatic text-based tables, which can calculate and sort by
columns.

# evil-mode<a id="orgheadline35"></a>

There is evil in the world. If you want to turn from evil to good, emacs may
help you change from your evil way **gradually**. For this there is `evil-mode`,
which people say does evil things in emacs **better than evil itself**.

<http://www.emacswiki.org/emacs/Evil>
